stress.yml
config:
  target: "http://localhost:3003"
  phases:
    - duration: 1
      arrivalRate: 1
      name: '1 per second'
    # - duration: 30
    #   arrivalRate: 10
    #   name: '10 per second'
    # - duration: 30
    #   arrivalRate: 100
    #   name: '100 per second'
    # - duration: 30
    #   arrivalRate: 100
    #   name: '1,000 per second'
  # payload:
  #   path: "keywords.csv"
  #   fields:
  #     - "keywords"
scenarios:
  - name: "trying out"
    flow:
    - get:
        url: "/api/rentals"
        qs:
          id: 509000003


  # - name: "Search and buy"
  #   flow:
  #     - post:
  #         url: "/search"
  #         body: "kw={{ keywords }}"
  #         capture:
  #           json: "$.results[0].id"
  #           as: "id"
  #     - get:
  #         url: "/details/{{ id }}"
  #     - think: 3
  #     - post:
  #         url: "/cart"
  #         json:
  #           productId: "{{ id }}"